#==============================================================================
# ■ バトル画面の枠線の途切れ解消 RGSS3 v1.0      MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　ステータスウィンドウに別のウィンドウが重なっても枠線を途切れなくします。
#==============================================================================

class Window_BattleActor
  #--------------------------------------------------------------------------
  # ● ウィンドウの表示【※再定義※】
  #--------------------------------------------------------------------------
  def show
    if @info_viewport
      width_remain = Graphics.width - width
      self.x = width_remain
      @info_viewport.rect.width = width_remain + 4
      select(0)
    end
    super
  end
end
#------------------------------------------------------------------------------
class Window_BattleEnemy
  #--------------------------------------------------------------------------
  # ● ウィンドウの表示【※再定義※】
  #--------------------------------------------------------------------------
  def show
    if @info_viewport
      width_remain = Graphics.width - width
      self.x = width_remain
      @info_viewport.rect.width = width_remain + 4
      select(0)
    end
    super
  end
end
