#==============================================================================
# ■ 逃走不能特徴 RGSS3 v1.0                      MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　アクター・職業・武器・防具・ステートのメモ欄に <逃走不能> と入力すると、
# バトルメンバーの誰かがその特徴を持っている間、逃走できなくします。
#==============================================================================

class << BattleManager
  #--------------------------------------------------------------------------
  # ● 逃走許可の取得【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_can_escape? can_escape?
  def can_escape?
    toruic_can_escape? && !$game_party.members.any? do |actor|
      actor.feature_objects.any? {|obj| obj.note.include?("<逃走不能>") }
    end
  end
end
