#==============================================================================
# ■ 武器不適合スキル戦闘時非表示 RGSS3 v1.0      MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　戦闘中、必要武器の条件を満たさないスキルを非表示にします。
#==============================================================================

class Window_BattleSkill
  #--------------------------------------------------------------------------
  # ● スキルをリストに含めるかどうか【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic2_include? include?
  def include?(item)
    toruic2_include?(item) && @actor.skill_wtype_ok?(item)
  end
end
