#==============================================================================
# ■ 封印済スキルコマンドを無効化 RGSS3 v1.1      MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　バトル画面で、封印されたスキルタイプのコマンドを選べなくします。
#==============================================================================

class Window_ActorCommand
  #--------------------------------------------------------------------------
  # ● スキルコマンドをリストに追加【※再定義※】
  #--------------------------------------------------------------------------
  def add_skill_commands
    @actor.added_skill_types.sort.each do |stype_id|
      name = $data_system.skill_types[stype_id]
      add_command(name, :skill, !@actor.skill_type_sealed?(stype_id), stype_id)
    end
  end
end
