#==============================================================================
# ■ バトルで自分を優先選択 RGSS3 v1.1            MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　スキル・アイテムの対象アクター選択のカーソル初期位置をその使用者にします。
#==============================================================================

class Window_BattleActor
  #--------------------------------------------------------------------------
  # ● ウィンドウの表示【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_show show
  def show
    toruic_show
    select(BattleManager.actor.index) if @info_viewport
    self
  end
end
