#==============================================================================
# ■ ドロップアイテム単一化 RGSS3 v1.0            MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　同じ敵が複数ドロップしないようにします。上のドロップアイテムが優先されます。
#==============================================================================

class Game_Enemy
  #--------------------------------------------------------------------------
  # ● ドロップアイテムの配列作成【※再定義※】
  #--------------------------------------------------------------------------
  def make_drop_items
    enemy.drop_items.inject([]) do |r, di|
      if di.kind > 0 && rand * di.denominator < drop_item_rate
        return r.push(item_object(di.kind, di.data_id))
      else
        r
      end
    end
  end
end
