#==============================================================================
# ■ プレイ中画面OFF抑制 RGSS3 v1.0               MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　プレイ中にディスプレイの電源が切れたりスクリーンセーバーが起動したりしない
# ようにします。ゲームパッドでのプレイや、長時間の放置を要する場合に有用です。
#==============================================================================

class << Graphics
  #--------------------------------------------------------------------------
  # ● 定数
  #--------------------------------------------------------------------------
  SetThreadExecutionState =
    Win32API.new("kernel32", "SetThreadExecutionState", "i", "i")
  #--------------------------------------------------------------------------
  # ● フレーム更新【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_update update
  def update
    SetThreadExecutionState.call(2) if frame_count % (frame_rate * 50) == 0
    toruic_update
  end
end
