#==============================================================================
# ■ レベル増減時HPとMP割合保持 RGSS3 v1.0        MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　アクターのレベルが増減したとき、HP と MP の数値ではなく割合を保持します。
# 例えば HP が満タンでレベルアップすれば、最大 HP が増えても満タンのままです。
#==============================================================================

class Game_Actor
  #--------------------------------------------------------------------------
  # ● レベルアップ【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_level_up level_up
  def level_up
    last_mhp = mhp
    last_mmp = mmp
    toruic_level_up
    @hp = -(-@hp * mhp / last_mhp)
    @mp = -(-@mp * mmp / last_mmp)
  end
  #--------------------------------------------------------------------------
  # ● レベルダウン【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_level_down level_down
  def level_down
    last_mhp = mhp
    last_mmp = mmp
    toruic_level_down
    @hp = -(-@hp * mhp / last_mhp)
    @mp = -(-@mp * mmp / last_mmp)
  end
end
