#==============================================================================
# ■ ロード後マップ名表示 RGSS3 v1.0              MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　ロード後にマップ名を表示します。
#==============================================================================

class Scene_Map
  #--------------------------------------------------------------------------
  # ● 【新規】ロード後の処理
  #--------------------------------------------------------------------------
  def on_loaded
    @loaded = true
  end
  #--------------------------------------------------------------------------
  # ● マップ名ウィンドウの作成【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_create_location_window create_location_window
  def create_location_window
    toruic_create_location_window
    if @loaded
      @map_name_window.open
      @loaded = false
    end
  end
end
#------------------------------------------------------------------------------
class Scene_Load
  #--------------------------------------------------------------------------
  # ● ロード成功時の処理【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_on_load_success on_load_success
  def on_load_success
    toruic_on_load_success
    SceneManager.scene.on_loaded
  end
end
