#==============================================================================
# ■ 乗船中のBGM自動切り替え禁止 RGSS3 v1.0       MIT License; see git.io/tic
#------------------------------------------------------------------------------
# 　乗り物に乗っている状態で場所移動したときのBGM自動切り替えを禁止します。
#==============================================================================

class Game_Map
  #--------------------------------------------------------------------------
  # ● BGM / BGS 自動切り替え【エイリアス】
  #--------------------------------------------------------------------------
  alias toruic_autoplay autoplay
  def autoplay
    if $game_player.vehicle
      $game_player.vehicle.walking_bgm = @map.bgm if @map.autoplay_bgm
      @map.bgs.play if @map.autoplay_bgs
      return
    end
    toruic_autoplay
  end
end
#------------------------------------------------------------------------------
class Game_Vehicle
  #--------------------------------------------------------------------------
  # ● 公開インスタンス変数
  #--------------------------------------------------------------------------
  attr_accessor :walking_bgm
end
